#include "int.h"


//static uint8_t last_int = 0;
/*-------------------------------------------------
 *  函数名INT_Init
 *	功能：  INT初始化
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void INT_Init(void)
{
	INT_PORT &= ~INT_PIN_MASK;
    
	INT_TRIS |= INT_PIN_MASK;
    
//    last_int = 0;
}
/*-------------------------------------------------
 *  函数名INT_Read
 *	功能：  读取READ的值
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void INT_Read(void)
{
	SYS.INT_Value = INT_PIN_MASK;
}
/*-------------------------------------------------
 *  函数名INT_Task
 *	功能：  读取READ的值
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void INT_Task(void)
{
	INT_Read();
}