#include "POWER.h"

#include "SYSCFG.h"
/*-------------------------------------------------
 * 函数名：POWER_INITIAL
 * 功能：  上电系统初始化
 * 输入：  无
 * 输出：  无
 --------------------------------------------------*/	
void POWER_INITIAL (void) 
{ 
	OSCCON = 0B01100001;	//系统时钟选择为内部振荡器8MHz
	INTCON = 0;  			//暂禁止所有中断
	PORTA = 0B00000000;		
	TRISA = 0B01000000;		//PA输入输出 0-输出 1-输入
							//PA4-OUT PA6-IN
	PORTC = 0B00000000; 	
	TRISC = 0B00000000;		//PC输入输出 0-输出 1-输入  
								
	WPUA = 0B01000000;    	//PA端口上拉控制 1-开上拉 0-关上拉
							//开PA6上拉
	WPUC = 0B00000000;    	//PC端口上拉控制 1-开上拉 0-关上拉
							//60系列PC口无上拉	
                            
	OPTION = 0B00001000;	//Bit3=1,WDT MODE,PS=000=WDT RATE 1:1                             
    PSRCA = 0B11111111;    	//源电流设置最大
    PSRCC = 0B11111111; 
    PSINKA = 0B11111111;    //灌电流设置最大
    PSINKC = 0B11111111;
                      
    MSCON = 0B00110000;		   	
	//Bit5:	PSRCAH4和PSRCA[4]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
	//Bit4:	PSRCAH3和PSRCA[3]共同决定源电流。00：4mA; 11: 33mA; 01、10:8mA
	//Bit3:	UCFG1<1:0>为01时此位有意义。0：禁止LVR；	 1：打开LVR
	//Bit2:	快时钟测量慢周期的平均模式。0：关闭平均模式；1：打开平均模式
	//Bit1:	0：关闭快时钟测量慢周期；1：打开快时钟测量慢周期
	//Bit0:	0：睡眠时停止工作：1： 睡眠时保持工作。
    //		当T2时钟不是选择指令时钟的时
}
