#include "buzztt.h"
/*按键和蜂鸣器共同使用*/
/*
	有源蜂鸣器，拉低就叫。
	
    不断检测是否出现报警，如果出现切换到蜂鸣器模式
    
    不报警的前提下：每隔10ms做一次按键检测，如果检测到按键按下进入按键模式，如果突然检测到报警退出按键模式，进入按键模式
    
    
	
*/


/*-------------------------------------------------
 *  函数名BUZZTT_Init
 *	功能：  初始化按键和蜂鸣器
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUZZTT_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  &= ~0B00000010;	//PC输入输出 0-输出 1-输入
    
    PC1 = 1; //先关闭蜂鸣器
}
/*-------------------------------------------------
 *  函数名KEY_Init
 *	功能：  初始化按键（输入）
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void KEY_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  |=  0B00000010;	//PC输入输出 0-输出 1-输入
    
    WPUC   |=  0B00000010;	//打开上拉输入
}
/*-------------------------------------------------
 *  函数名Hummer_Init
 *	功能：  初始化蜂鸣器（输出）
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void Hummer_Init(void)
{
	PORTC   =  0B00000000; 	
	TRISC  &= ~0B00000010;	//PC输入输出 0-输出 1-输入
    
    WPUC   &= ~0B00000010;	//关闭上拉输入
}
/*-------------------------------------------------
 *  函数名BUZZHH_Control
 *	功能：  1:蜂鸣器；0：按键；
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void BUZZHH_Control(void)
{
	if(SYS.LB_Value||SYS.INT_Value)//蜂鸣器
    {
		Hummer_Task();
    }
    else if(SYS.STANDBY_Value)//按键(待机状态下且无报警)
    {
		Key_Task();
    }
}
static uint8_t KEY_Press = 0;

/*-------------------------------------------------
 *  函数名Key_Detect
 *	功能：  按键检测(10ms执行一次),3s长按
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	
void Key_Detect(void)
{
	static uint8_t press_cnt  = 0;		// 消抖计数
    static uint16_t long_cnt  = 0;		// 长按计时
    static uint8_t  long_trig = 0;      // 新增：长按已触发标志 (0=未触发, 1=已触发)

	if(PC1 == 0)//按键按下
	{
		// 1. 消抖
		if(press_cnt <4)//执行4次,总计20ms
		{
			press_cnt  ++;
		}
		else
		{
			KEY_Press = 1;//表示按键按下
		}
        
		 // 2. 长按计时（仅在“未触发”且“未超时”时累加）
        if(KEY_Press && long_trig == 0 && long_cnt<LONG_Press_Time)
        {
			long_cnt++;
        }
        
        
        // 3. 长按触发（达到3秒 且 尚未触发过）
        if(KEY_Press && long_cnt >= LONG_Press_Time && long_trig == 0)
        {
			//长按动作（只执行一次）
            SYS.Long_Time_Change = 0;
            SYS.KEY_Value = 1;

            long_trig = 1;  // 关键：标志置1，以后不再进入本分支
        }

	}
	else//松开按键
	{
		// 松手时把所有状态复位，以便下次重新长按
        press_cnt = 0;
        KEY_Press = 0;
        long_cnt = 0;
        long_trig = 0;  // 复位触发标志
	}
}
/*-------------------------------------------------
 *  函数名Key_Task
 *	功能：  按键任务
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	

void Key_Task(void)
{
	KEY_Init();
    Key_Detect();
}
/*-------------------------------------------------
 *  函数名Hummer_Task
 *	功能：  蜂鸣器任务
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	

void Hummer_Task(void)
{
	Hummer_Init();
    PC1 = 0;
}
/*-------------------------------------------------
 *  函数名BUZZTT_Task
 *	功能：  按键和蜂鸣器任务
 *  输入：  无
 *  输出：  无
 --------------------------------------------------*/	

void BUZZTT_Task(void)
{
	BUZZHH_Control();//先判断是按键还是蜂鸣器有效,进行初始化
}